|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

### Set 1

#### Read data and describe it

In [6]:
import pandas as pd
import numpy as np

In [22]:
df = pd.read_csv('titanic_dataset.csv' , index_col=0)
#print(df)
print(df.describe())
df1 = df

            pclass     survived          age        sibsp        parch  \
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000
mean      2.294882     0.381971    29.881135     0.498854     0.385027
std       0.837836     0.486055    14.413500     1.041658     0.865560
min       1.000000     0.000000     0.166700     0.000000     0.000000
25%       2.000000     0.000000    21.000000     0.000000     0.000000
50%       3.000000     0.000000    28.000000     0.000000     0.000000
75%       3.000000     1.000000    39.000000     1.000000     0.000000
max       3.000000     1.000000    80.000000     8.000000     9.000000

             body
count  121.000000
mean   160.809917
std     97.696922
min      1.000000
25%     72.000000
50%    155.000000
75%    256.000000
max    328.000000

#### Find columns with missingdata

In [23]:
r = df.isna()
print(r)
#print(r.any())
print()
print('~~~The columns with missing data are: ~~~~')
print(r.any()[r.any()])
#df[~ r]

      pclass  survived   name  gender    age  sibsp  parch  ticket   fare  \
0      False     False  False   False  False  False  False   False  False
1      False     False  False   False  False  False  False   False  False
2      False     False  False   False  False  False  False   False  False
3      False     False  False   False  False  False  False   False  False
4      False     False  False   False  False  False  False   False  False
...      ...       ...    ...     ...    ...    ...    ...     ...    ...
1304   False     False  False   False  False  False  False   False  False
1305   False     False  False   False   True  False  False   False  False
1306   False     False  False   False  False  False  False   False  False
1307   False     False  False   False  False  False  False   False  False
1308   False     False  False   False  False  False  False   False  False

      cabin  embarked   boat   body  home.dest
0     False     False  False   True      False
1     False     False  False   True      False
2     False     False   True   True      False
3     False     False   True  False      False
4     False     False   True   True      False
...     ...       ...    ...    ...        ...
1304   True     False   True  False       True
1305   True     False   True   True       True
1306   True     False   True  False       True
1307   True     False   True   True       True
1308   True     False   True   True       True

[1309 rows x 14 columns]

~~~The columns with missing data are: ~~~~
age          True
fare         True
cabin        True
embarked     True
boat         True
body         True
home.dest    True
dtype: bool

#### Print shape of dataset

In [24]:
print(df.shape)
#print(df)

(1309, 14)

#### drop columns with more than 25% missing data

In [25]:
df.dropna(axis=1, thresh=0.75*df.shape[0], inplace=True )
print(df)
print(df.shape)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

      gender      age  sibsp  parch  ticket      fare embarked
0     female  29.0000      0      0   24160  $211.34         S
1       male   0.9167      1      2  113781  $151.55         S
2     female   2.0000      1      2  113781  $151.55         S
3       male  30.0000      1      2  113781  $151.55         S
4     female  25.0000      1      2  113781  $151.55         S
...      ...      ...    ...    ...     ...       ...      ...
1304  female  14.5000      1      0    2665   $14.45         C
1305  female      NaN      1      0    2665   $14.45         C
1306    male  26.5000      0      0    2656    $7.23         C
1307    male  27.0000      0      0    2670    $7.23         C
1308    male  29.0000      0      0  315082    $7.88         S

[1309 rows x 10 columns]
(1309, 10)

#### drop columns having independent values(which do not affect the survival rate)

In [26]:
print(df.head(2))

   pclass  survived                            name  gender      age  sibsp  \
0       1         1   Allen, Miss. Elisabeth Walton  female  29.0000      0
1       1         1  Allison, Master. Hudson Trevor    male   0.9167      1

   parch  ticket      fare embarked
0      0   24160  $211.34         S
1      2  113781  $151.55         S

In [30]:
#help(df.drop)
r = df.drop(['name','ticket'],axis=1,inplace=True)
#print(r)
print(df)

      pclass  survived  gender      age  sibsp  parch      fare embarked
0          1         1  female  29.0000      0      0  $211.34         S
1          1         1    male   0.9167      1      2  $151.55         S
2          1         0  female   2.0000      1      2  $151.55         S
3          1         0    male  30.0000      1      2  $151.55         S
4          1         0  female  25.0000      1      2  $151.55         S
...      ...       ...     ...      ...    ...    ...       ...      ...
1304       3         0  female  14.5000      1      0   $14.45         C
1305       3         0  female      NaN      1      0   $14.45         C
1306       3         0    male  26.5000      0      0    $7.23         C
1307       3         0    male  27.0000      0      0    $7.23         C
1308       3         0    male  29.0000      0      0    $7.88         S

[1309 rows x 8 columns]

In [31]:
#print(r.shape)
print(df.shape)

(1309, 8)

In [54]:
res_1 = df
#df= res_1

### Set 2

#### check data types of all columns

In [40]:
print(df.dtypes)

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

#### convert price to numeric

In [55]:


df['fare'] = df['fare'].replace('[\$]', '',regex=True).astype(float)
df.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare        float64
embarked     object
dtype: object

In [56]:
print(df)

      pclass  survived  gender      age  sibsp  parch    fare embarked
0          1         1  female  29.0000      0      0  211.34        S
1          1         1    male   0.9167      1      2  151.55        S
2          1         0  female   2.0000      1      2  151.55        S
3          1         0    male  30.0000      1      2  151.55        S
4          1         0  female  25.0000      1      2  151.55        S
...      ...       ...     ...      ...    ...    ...     ...      ...
1304       3         0  female  14.5000      1      0   14.45        C
1305       3         0  female      NaN      1      0   14.45        C
1306       3         0    male  26.5000      0      0    7.23        C
1307       3         0    male  27.0000      0      0    7.23        C
1308       3         0    male  29.0000      0      0    7.88        S

[1309 rows x 8 columns]

#### find columns still having missing/na values and also count of missing data    ==================>

In [64]:
s1 = df.count() 
print(s1) 
r = s1.values < df.shape[0]
print(r)

pclass      1309
survived    1309
gender      1309
age         1046
sibsp       1309
parch       1309
fare        1308
embarked    1307
dtype: int64
[False False False  True False False  True  True]

#### fill na with mean for fare and age column column.         ==================>

In [72]:
print(df.describe())
r = df.fillna({'fare':df.describe()['fare'].loc['mean'], 'age': df.describe()['age'].loc['mean']} ,inplace=True)
#print(r)
#print(r.count())
print(df)
print(df.count())

            pclass     survived          age        sibsp        parch  \
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000
mean      2.294882     0.381971    29.881135     0.498854     0.385027
std       0.837836     0.486055    14.413500     1.041658     0.865560
min       1.000000     0.000000     0.166700     0.000000     0.000000
25%       2.000000     0.000000    21.000000     0.000000     0.000000
50%       3.000000     0.000000    28.000000     0.000000     0.000000
75%       3.000000     1.000000    39.000000     1.000000     0.000000
max       3.000000     1.000000    80.000000     8.000000     9.000000

              fare
count  1308.000000
mean     33.296261
std      51.758691
min       0.000000
25%       7.900000
50%      14.450000
75%      31.280000
max     512.330000
      pclass  survived  gender        age  sibsp  parch    fare embarked
0          1         1  female  29.000000      0      0  211.34        S
1          1         1    male   0.916700      1      2  151.55        S
2          1         0  female   2.000000      1      2  151.55        S
3          1         0    male  30.000000      1      2  151.55        S
4          1         0  female  25.000000      1      2  151.55        S
...      ...       ...     ...        ...    ...    ...     ...      ...
1304       3         0  female  14.500000      1      0   14.45        C
1305       3         0  female  29.881135      1      0   14.45        C
1306       3         0    male  26.500000      0      0    7.23        C
1307       3         0    male  27.000000      0      0    7.23        C
1308       3         0    male  29.000000      0      0    7.88        S

[1309 rows x 8 columns]
pclass      1309
survived    1309
gender      1309
age         1309
sibsp       1309
parch       1309
fare        1309
embarked    1307
dtype: int64

#### drop na values for embarked column.

In [75]:
r = df.dropna(axis=0, how='any' ,inplace=True) #drop row with na in embarked
#r.count()
print(df.count())

pclass      1307
survived    1307
gender      1307
age         1307
sibsp       1307
parch       1307
fare        1307
embarked    1307
dtype: int64

#### dump the dataframe to a csv file 'titanic_filtered.csv'.

In [76]:
df.to_csv("titanic_filtered.csv")

In [77]:
res_2 =df

### Set 3

#### for survived column replace 0 with D and 1 with A

In [81]:
df.survived = df.survived.replace({0:'D' , 1:'A' })

In [82]:
print(df)

      pclass survived  gender        age  sibsp  parch    fare embarked
0          1        A  female  29.000000      0      0  211.34        S
1          1        A    male   0.916700      1      2  151.55        S
2          1        D  female   2.000000      1      2  151.55        S
3          1        D    male  30.000000      1      2  151.55        S
4          1        D  female  25.000000      1      2  151.55        S
...      ...      ...     ...        ...    ...    ...     ...      ...
1304       3        D  female  14.500000      1      0   14.45        C
1305       3        D  female  29.881135      1      0   14.45        C
1306       3        D    male  26.500000      0      0    7.23        C
1307       3        D    male  27.000000      0      0    7.23        C
1308       3        D    male  29.000000      0      0    7.88        S

[1307 rows x 8 columns]

#### find the frequency of different values in survived column

In [85]:
#print(df.value_counts())
print(df.survived.value_counts())

D    809
A    498
Name: survived, dtype: int64

#### group by gender and survived and see the counts in each category

In [94]:
grp = df.groupby(by="gender")
print(grp)
print(grp.groups)
print(grp.count())
print()
print(grp.survived.count())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F51B9987C8>
{'female': [0, 2, 4, 6, 8, 11, 12, 13, 17, 18, 21, 23, 24, 27, 28, 32, 33, 35, 36, 41, 42, 43, 44, 48, 50, 55, 57, 59, 61, 63, 65, 66, 67, 69, 72, 73, 76, 78, 79, 82, 83, 85, 88, 90, 92, 95, 97, 98, 99, 102, 103, 104, 105, 107, 108, 111, 112, 113, 116, 117, 121, 122, 124, 127, 129, 130, 131, 134, 137, 139, 141, 144, 146, 149, 153, 155, 159, 160, 161, 163, 167, 169, 176, 178, 180, 181, 182, 186, 187, 188, 190, 192, 193, 195, 198, 199, 204, 207, 208, 213, ...], 'male': [1, 3, 5, 7, 9, 10, 14, 15, 16, 19, 20, 22, 25, 26, 29, 30, 31, 34, 37, 38, 39, 40, 45, 46, 47, 49, 51, 52, 53, 54, 56, 58, 60, 62, 64, 68, 70, 71, 74, 75, 77, 80, 81, 84, 86, 87, 89, 91, 93, 94, 96, 100, 101, 106, 109, 110, 114, 115, 118, 119, 120, 123, 125, 126, 128, 132, 133, 135, 136, 138, 140, 142, 143, 145, 147, 148, 150, 151, 152, 154, 156, 157, 158, 162, 164, 165, 166, 170, 171, 172, 173, 174, 175, 177, 179, 183, 184, 185, 189, 191, ...]}
        pclass  survived  age  sibsp  parch  fare  embarked
gender
female     464       464  464    464    464   464       464
male       843       843  843    843    843   843       843

gender
female    464
male      843
Name: survived, dtype: int64

#### find different pclass and no of people in each class

In [98]:
grp = df.groupby(by='pclass')
print(grp)
print(grp.groups)
print()
print(grp.age.count())
print()
print(grp.pclass.count())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F51BBE3208>
{1: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...], 2: [323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, ...], 3: [600, 601, 602, 603, 604, 605, 606, 607, 608, 609, 610, 611, 612, 613, 614, 615, 616, 617, 618, 619, 620, 621, 622, 623, 624, 625, 626, 627, 628, 629, 630, 631, 632, 633, 634, 635, 636, 637, 638, 639, 640, 641, 642, 643, 644, 645, 646, 647, 648, 649, 650, 651, 652, 653, 654, 655, 656, 657, 658, 659, 660, 661, 662, 663, 664, 665, 666, 667, 668, 669, 670, 671, 672, 673, 674, 675, 676, 677, 678, 679, 680, 681, 682, 683, 684, 685, 686, 687, 688, 689, 690, 691, 692, 693, 694, 695, 696, 697, 698, 699, ...]}

pclass
1    321
2    277
3    709
Name: age, dtype: int64

pclass
1    321
2    277
3    709
Name: pclass, dtype: int64

#### find top 5 people with highest values of age. Count no of male and females in the top 5

In [103]:
df_top5 = df.sort_values(by='age', ascending=False).head(5)
print(df_top5)
print()
print('~~~~~~Number of Male and Female in top 5 people with highest values of Age~~~')
grp = df_top5.groupby(by='gender')
print(grp.gender.count())

      pclass survived  gender   age  sibsp  parch   fare embarked
14         1        A    male  80.0      0      0  30.00        S
61         1        A  female  76.0      1      0  78.85        S
1235       3        D    male  74.0      0      0   7.78        S
135        1        D    male  71.0      0      0  34.65        C
9          1        D    male  71.0      0      0  49.50        C

~~~~~~Number of Male and Female in top 5 people with highest values of Age~~~
gender
female    1
male      4
Name: gender, dtype: int64

#### find max age male and female who survived

In [116]:
r1 = df.survived == 'A'
print(r1)
print('The ones who survived ')
r2 = df[r1].sort_values(by='age', ascending=False)
print(r2)
print()

grp = r2.groupby(by='gender')
print(grp.groups)

print()
print('Male')
print(df.loc[grp.groups['male'][0]])
print()
print('Female')
print(df.loc[grp.groups['female'][0]])

0        True
1        True
2       False
3       False
4       False
        ...
1304    False
1305    False
1306    False
1307    False
1308    False
Name: survived, Length: 1307, dtype: bool
The ones who survived
      pclass survived  gender      age  sibsp  parch   fare embarked
14         1        A    male  80.0000      0      0  30.00        S
61         1        A  female  76.0000      1      0  78.85        S
78         1        A  female  64.0000      0      2  83.16        C
83         1        A  female  64.0000      1      1  26.55        S
6          1        A  female  63.0000      1      0  77.96        S
...      ...      ...     ...      ...    ...    ...    ...      ...
657        3        A  female   0.7500      2      1  19.26        C
658        3        A  female   0.7500      2      1  19.26        C
427        2        A    male   0.6667      1      1  14.50        S
1240       3        A    male   0.4167      0      1   8.52        C
763        3        A  female   0.1667      1      2  20.58        S

[498 rows x 8 columns]

{'female': [61, 78, 83, 6, 1261, 304, 116, 43, 42, 192, 50, 33, 139, 233, 79, 186, 441, 308, 449, 95, 104, 247, 48, 8, 282, 155, 188, 161, 17, 551, 570, 529, 314, 181, 146, 98, 288, 99, 253, 387, 124, 440, 1290, 63, 21, 471, 371, 131, 647, 141, 851, 311, 35, 178, 436, 41, 160, 281, 238, 358, 489, 23, 502, 44, 352, 564, 260, 583, 275, 296, 291, 76, 180, 218, 263, 103, 85, 1286, 646, 208, 329, 333, 342, 759, 322, 66, 57, 82, 355, 735, 302, 362, 257, 603, 127, 149, 163, 28, 167, 129, ...], 'male': [14, 432, 123, 264, 280, 136, 93, 231, 86, 119, 100, 170, 133, 292, 145, 5, 274, 742, 68, 240, 1233, 120, 454, 177, 47, 31, 917, 1064, 165, 20, 758, 49, 56, 202, 109, 261, 183, 164, 259, 343, 905, 909, 278, 1088, 336, 1131, 981, 714, 674, 596, 1228, 298, 91, 538, 209, 760, 858, 805, 798, 874, 597, 1035, 1034, 152, 1080, 1121, 1162, 37, 524, 1033, 887, 320, 926, 945, 256, 254, 991, 235, 196, 1003, 219, 1000, 746, 935, 1196, 526, 880, 29, 265, 630, 978, 87, 151, 857, 64, 889, 949, 613, 22, 360, ...]}

Male
pclass         1
survived       A
gender      male
age           80
sibsp          0
parch          0
fare          30
embarked       S
Name: 14, dtype: object

Female
pclass           1
survived         A
gender      female
age             76
sibsp            1
parch            0
fare         78.85
embarked         S
Name: 61, dtype: object

#### get average age by gender

In [127]:
df_male = df[df.gender == 'male']
print(df_male)
print('Average male Age: ')
print(df_male.describe()["age"]["mean"])
print()
print('Average female Age: ')
print( df[df.gender == 'female'].describe()["age"].loc["mean"])

      pclass survived gender        age  sibsp  parch    fare embarked
1          1        A   male   0.916700      1      2  151.55        S
3          1        D   male  30.000000      1      2  151.55        S
5          1        A   male  48.000000      0      0   26.55        S
7          1        D   male  39.000000      0      0    0.00        S
9          1        D   male  71.000000      0      0   49.50        C
...      ...      ...    ...        ...    ...    ...     ...      ...
1302       3        D   male  29.881135      0      0    7.23        C
1303       3        D   male  29.881135      0      0   14.46        C
1306       3        D   male  26.500000      0      0    7.23        C
1307       3        D   male  27.000000      0      0    7.23        C
1308       3        D   male  29.000000      0      0    7.88        S

[843 rows x 8 columns]
Average male Age:
30.430715521707075

Average female Age:
28.79593080165825

#### get average age by people survived vs not-survived

In [128]:
print('Average survived Age: ')
print( df[df.survived == 'A'].describe()["age"].loc["mean"])
print()
print('Average not survived Age: ')
print( df[df.survived == 'D'].describe()["age"].loc["mean"])

Average survived Age:
28.97471128395037

Average not survived Age:
30.38936817968011